[
  {
    "title": "Facebook Ads Campaigns",
    "description": "Highly targeted and result-driven Facebook ad campaigns designed to maximize ROI. From audience research and custom segmentation to creative ad copy and A/B testing, we ensure your ads reach the right people, drive meaningful engagement, and convert clicks into loyal customers."
  },
  {
    "title": "Google Ads Management",
    "description": "Comprehensive Google Ads management with smart bidding strategies, keyword optimization, and performance tracking. We craft tailored campaigns that place your business in front of the right audience at the right time, ensuring higher click-through rates, reduced ad spend waste, and measurable growth."
  },
  {
    "title": "SEO Optimization",
    "description": "End-to-end SEO solutions including on-page optimization, technical audits, and keyword strategy to help your website rank higher on search engines. We focus on improving site speed, mobile responsiveness, and structured data while building a strong content and backlink profile for long-term visibility."
  },
  {
    "title": "YouTube SEO & Thumbnails",
    "description": "Boost your video performance with optimized titles, descriptions, tags, and playlists. We design eye-catching, click-worthy thumbnails that increase watch time and subscriber growth, while applying proven YouTube SEO techniques to help your content appear in search results and suggested feeds."
  },
  {
    "title": "Social Media Post Design",
    "description": "Engaging and creative social media visuals tailored to your brand identity. From carousel posts and infographics to story highlights and reels, we design content that resonates with your audience, strengthens brand presence, and encourages shares, likes, and meaningful interactions."
  },
  {
    "title": "Logo & Branding",
    "description": "Professional logo design and complete branding solutions that capture your business's essence. We create unique visual identities including color palettes, typography, and brand guidelines to ensure consistency across all platforms, helping your brand stand out and leave a lasting impression."
  }
]
